tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'ethereum/ethereum'
tap 'tenderly/tenderly'
tap 'hpedrorodrigues/homebrew-tools'
tap 'hashicorp/tap'

# System
brew 'git'
brew 'openssl'
brew 'the_silver_searcher'
brew 'tmux'
brew 'vim'
brew 'neovim'
brew 'zsh'
brew 'htop'
brew 'tree'
brew 'mas'
brew 'defaultbrowser'
brew 'z'
brew 'ImageMagick'
cask 'rar'

# Programming language prerequisites and package managers
brew 'libyaml' # should come after openssl
brew 'coreutils'
brew 'yarn'
brew 'solidity'
brew 'typescript'
brew 'asdf'
brew 'tenderly'
cask 'gpg-suite'
brew 'hashicorp/tap/terraform'

# Common Apps
cask 'iterm2'
cask 'google-chrome'
cask '1password'
cask '1password-cli'
cask 'dropbox'
cask 'spectacle'
cask 'wechat'
cask 'discord'
cask 'setapp'
cask 'microsoft-word'
cask 'microsoft-excel'
cask 'microsoft-outlook'
cask 'slack'
cask 'zoom'
cask 'telegram'
cask 'visual-studio-code'
cask 'rescuetime'
cask 'dockutil'
cask 'pomotodo'
cask 'grammarly'

# Databases
brew 'postgres', restart_service: :changed
brew 'redis', restart_service: :changed

# Mac App Store
mas 'Bear', id: 1091189122
mas 'Spark', id: 1176895641
mas 'Reeder', id: 1529445840
